app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["desc", "description"], ["created_at", "2021-10-22 07:30:57.264882"], ["updated_at", "2021-10-22 07:30:57.264882"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save